import random
from typing import List, Union
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме isinstance(), filter()
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Оставь только строки и списки из списка:
items = [5, "hello", [1, 2], 3.14, {"a": 1}, "world"]
Ожидаемый результат:
['hello', [1, 2], 'world']
===============================================
"""

items = [5, "hello", [1, 2], 3.14, {"a": 1}, "world"]
ans_items = list(filter(lambda x: isinstance(x, (str, list)), items))
print(ans_items)

"""
2. Создай функцию describe_type(x), которая:
печатает "Это строка", если x — строка
"Это число", если x — int или float
"Это булевое значение", если x — bool
"Неизвестный тип" — в остальных случаях
Пример вызова:
describe_type(5.5)       # Это число
describe_type(True)      # Это булево значение
describe_type("Привет")  # Это строка
describe_type([1, 2, 3]) # Неизвестный тип
===============================================
"""


def describe_type(x):
    if isinstance(x, str):
        print("Это строка")
    elif type(x) is int or type(x) is float:
        print("Это число")
    elif type(x) is bool:
        print("Это булевое значение")
    else:
        print("Неизвестный тип")


describe_type(5.5)       # Это число
describe_type(True)      # Это булево значение
describe_type("Привет")  # Это строка
describe_type([1, 2, 3]) # Неизвестный тип

"""
3. Создай функцию filter_list(f, data: list[int]) -> list[int],
которая возвращает только те элементы из data, которые проходят проверку функцией f.
Проверь на функции lambda x: x > 3 и списке [1, 3, 5, 7].
===============================================
"""


def filter_list(f, data: List[int]) -> List[int]:
    return list(filter(f, data))


print(filter_list(lambda x: x > 3, [1, 3, 5, 7]))

"""
4. Добавь аннотацию типов в следующую функцию и укажи, что она возвращает None:
def print_info(name, age, tags):
    print(name, age, tags)
===============================================
"""


def print_info(name: str, age: int, tags: List[str]) -> None:
    print(name, age, tags)

"""
5. Создай функцию def analyze(data),
которая выводит количество элементов и среднее значение, если список не пустой.
===============================================
"""


def analyze(data):
    if data:
        print(f"количество элементов {len(data)}, среднее значение {sum(data)/len(data)}")


analyze([])
analyze([1, 2, 3, 4])

"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме all() и any()
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
6. Список логических значений:
flags = [True, True, True, False]
Проверь:
Все ли значения истинные
Есть ли среди них хотя бы одно истинное
Ожидаемый результат:
False
True
===============================================
"""

flags = [True, True, True, False]


print(all(flags))
print(any(flags))

"""
7. Поле в игре "Крестики-нолики" представлено так:
field = ['x', 'x', 'x', 'o', 'o', '', '', '', '']
Проверь, победил ли 'x' по первой строке.
Ожидаемый результат:
True
===============================================
"""

field = ['x', 'x', 'x', 'o', 'o', '', '', '', '']
print(all(i == 'x' for i in field[:3]))

"""
8. На поле для "Сапёра" находится мина, если в ячейке символ *. Есть ли мина?
P = ['0', '0', '0', '*', '0']
Ожидаемый результат:
True
===============================================
"""

P = ['0', '0', '0', '*', '0']
print(any(i == "*" for i in P))

"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме random
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
9. Выбери случайное значение из списка:
colors = ["red", "green", "blue", "yellow", "purple"]
Ожидаемый результат:
Выбран цвет: blue
===============================================
"""

colors = ["red", "green", "blue", "yellow", "purple"]
print(f"Выбран цвет: {random.choice(colors)}")

"""
10. Сгенерируй 10 случайных чисел от 0 до 100 и выведи их. Сделай так, чтобы результат был одинаковый при каждом запуске.
===============================================
"""

random.seed(1)
ans_10 = [random.randint(0, 101) for _ in range(10)]
print(ans_10)

"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме "Аннотация типов в Python"
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
11. Напиши функцию greet(), которая принимает строку name и возвращает строку Привет, <name>!.
Добавь аннотацию типов.
Ожидаемый вывод:
Привет, Анна!
===============================================
"""


def greet(name: str) -> str:
    return f"Привет, {name}!"


print(greet("Анна"))

"""
12. Создай функцию multiply(a, b), которая принимает два числа int или float и возвращает их произведение.
Добавь аннотацию типов.
Ожидаемый вывод:
20
"""


def multiply(a: Union[int, float], b: Union[int, float]) -> Union[int, float]:
    return a * b


print(multiply(5, 4))

"""
13. Проверь типы аргументов функции через __annotations__.
Создай функцию area(length: float, width: float) -> float и распечатай её аннотации.
Ожидаемый вывод:
{'length': <class 'float'>, 'width': <class 'float'>, 'return': <class 'float'>}
"""


def area(length: float, width: float) -> float:
    return length * width


print(area.__annotations__)


