"""
++++++++++++++++++++++++++++++++++++++++++++++++
Множества в Python
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Создайте множество с элементами .
Добавьте в него число, затем попробуйте добавить уже существующий элемент.
Выведите итоговое множество.
===============================================
"""

my_set1 = {1, 2, 3, 4}
my_set1.add(5)
my_set1.add(4)
print(my_set1)

"""
2. Создайте множество из списка городов:
Выведите его на экран.
Сколько уникальных городов в этом списке?
===============================================
"""

lst_cities = ["Moscow", "Minsk", "Grodno", "Gomel", "Brest", "Minsk"]
set_cities = set(lst_cities)
print(len(set_cities))

"""
3. Создайте множество с числами от 1 до 10.
Удалите из него:
Число 5 (если оно есть).
Число 15 (используйте метод, который не вызовет ошибку).
Выведите итоговое множество.
===============================================
"""

my_set3 = {i for i in range(1, 11)}
my_set3.discard(5)
my_set3.discard(15)
print(my_set3)

"""
4. Преобразуйте строку "abrakadabra" в множество символов.
Выведите итоговое множество и определите, сколько различных букв в слове.
===============================================
"""

my_set4 = set("abrakadabra")
print(my_set4)
print(len(my_set4))

"""
5. Создайте пустое множество и попробуйте добавить в него следующие элементы:
Число 10
Строку "hello"
Кортеж (1, 2, 3)
Список [4, 5, 6]
Какие из элементов нельзя добавить в множество? Почему?
===============================================
"""

my_set5 = set()
my_set5.add(10)
my_set5.add((1, 2, 3))
print(my_set5)
#my_set5.add([4, 5, 6])

"""
6. Создайте 2 множества, в которых совпадают 2 элемента
Найдите:
Пересечение A и B.
Объединение A и B.
Разность A - B.
Разность B - A.
Симметричную разность A ^ B.
===============================================
"""

set_A = {1, 2, 3, 4, 5}
set_B = {4, 5, 6, 7, 8}
res = set_A & set_B
print(res)
res = set_A | set_B
print(res)
res = set_A - set_B
print(res)
res = set_B - set_A
print(res)
res = set_A ^ set_B
print(res)

"""
7. Создайте два множества из чисел 1 до 10:
even_numbers — содержит четные числа.
odd_numbers — содержит нечетные числа.
Проверьте:
Какое будет пересечение &?
Какое будет объединение |?
===============================================
"""

set_even = {i for i in range(1, 11) if i % 2 == 0}
set_odd = {i for i in range(1, 11) if i % 2 != 0}
res1 = set_even & set_odd
print(res1)
res2 = set_even | set_odd
print(res2)

"""
8. Даны множества студентов, записавшихся на курсы:
python_students = {"Анна", "Иван", "Мария", "Сергей"}
java_students = {"Иван", "Дмитрий", "Сергей", "Алексей"}
Определите:
Кто записан на оба курса?
Кто записан только на один курс?
Кто записан хотя бы на один курс?
===============================================
"""

python_students = {"Анна", "Иван", "Мария", "Сергей"}
java_students = {"Иван", "Дмитрий", "Сергей", "Алексей"}
res_both = python_students & java_students
print(res_both)
res_only_one = python_students ^ java_students
print(res_only_one)
res_at_least_one = python_students | java_students
print(res_at_least_one)

"""
9. Даны множества слов:
text1 = set("программирование")
text2 = set("автоматизация")
Найдите общие буквы в двух словах.
Найдите буквы, которые есть только в первом слове.
Найдите уникальные буквы каждого слова.
"""

text1 = set("программирование")
text2 = set("автоматизация")
common_letters = text1 & text2
word1_unique_letters = text1 - text2
word1_2_unique_letters = text1 ^ text2
print(common_letters)
print(word1_unique_letters)
print(word1_2_unique_letters)

"""
++++++++++++++++++++++++++++++++++++++++++++++++
Генераторы множеств и словарей
++++++++++++++++++++++++++++++++++++++++++++++++
1. Создайте множество из квадратов чисел от 1 до 10, но только для четных чисел.
"""

set_sq = {i**2 for i in range(1, 11) if i % 2 == 0}
print(set_sq)

"""
2. Дан список:
words = ["apple", "banana", "cherry", "apple", "banana", "date", "cherry"]
Создайте множество уникальных слов, преобразовав их в верхний регистр.
"""

words = ["apple", "banana", "cherry", "apple", "banana", "date", "cherry"]
set_words = {word.upper() for word in words}

"""
3. Дан словарь:

grades = {"Alice": 85, "Bob": 78, "Charlie": 92, "David": 60, "Eve": 88}
Используя генератор, создайте новый словарь, где:
Если оценка больше или равна 80, записать "отлично".
Если меньше 80, записать "удовлетворительно".
"""

grades = {"Alice": 85, "Bob": 78, "Charlie": 92, "David": 60, "Eve": 88}
grades2 = {key: "отлично" if value >= 80 else "удовлетворительно" for key, value in grades.items()}
print(grades2)

"""
4. Дано множество слов:

text = {"Python", "automation", "programming", "testing"}
Создайте новый словарь, где ключи – это слова из множества, а значения – длина каждого слова.
"""

text = {"Python", "automation", "programming", "testing"}
text_dict = {word: len(word) for word in text}
print(text_dict)

"""
5. Создайте вложенный словарь, где ключи – числа от 1 до n (для примера пусть n = 10), а значения – множества квадратов чисел от 1 до ключа.
Пример для n = 3:

{
1: {1},
2: {1, 4},
3: {1, 4, 9}
}
"""

N = int(input())
res_dict = {n: {i**2 for i in range(1, n+1)} for n in range(1, N+1)}
print(res_dict)

