"""
++++++++++++++++++++++++++++++++++++++++++++++++
Методы строк
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Работа с регистром
================================================
Создай строку s = "Python для автоматизации".
Преобразуй строку в верхний регистр и выведи результат.
Преобразуй строку в нижний регистр и выведи результат.
================================================
"""

s = "Python для автоматизации"
print(s.upper())
print(s.lower())

"""
2. Подсчет вхождений подстроки
================================================
Создай строку msg = "абракадабра".
Найди, сколько раз встречается подстрока "ра" в строке msg.
Определи количество "а", начиная с 3-го символа.
================================================
"""

msg = "абракадабра"
print(msg.count("ра"))
print(msg[2:].count("а"))

"""
3. Поиск подстроки
================================================
Определи индекс первого вхождения "ка" в строке "абракадабра".
Найди индекс последнего вхождения "а".
Проверь, что произойдет, если искать "xyz" в строке.
================================================
"""

index_first = msg.find("ка")
print(index_first)
index_last = msg.rfind("а")
print(index_last)
print(msg.find("xyz"))

"""
4. Замена подстроки
================================================
Создай строку text = "Я изучаю Java".
Замени "Java" на "Python".
Удали все пробелы из строки.
================================================
"""

text = "Я изучаю Java"
print(text.replace("Java", "Python"))
print(text.replace(" ", ""))

"""
5. Проверка содержимого строки
================================================
Проверь, состоит ли строка "Python" только из букв.
Проверь, состоит ли строка "12345" только из цифр.
Проверь, что строка "123abc" не состоит только из цифр.
================================================
"""

print("Python".isalpha())
print("12345".isdigit())
print(not "123abc".isdigit())

"""
6. Дополнение строк
================================================
Создай строку code = "42", дополни её до 5 символов слева нулями.
Выравнивай строку "text" по ширине 10, добавляя * справа.
================================================
"""

code = "42"
print(code.rjust(5, '0'))
print("text".ljust(10, "*"))

"""
7. Разбиение строк
================================================
Разбей строку "яблоко, груша, банан" на список слов.
Разбей "Python;Java;C++" по ";".
================================================
"""

fruits = "яблоко, груша, банан"
fruits_lst = fruits.split()
print(fruits_lst)
languages = "Python;Java;C++"
languages_lst = languages.split(";")
print(languages_lst)

"""
8. Объединение списка в строку
================================================
Соедини список ["Привет", "мир", "!"] в строку с пробелами.
Преобразуй список ["apple", "banana", "cherry"] в строку через ", ".
================================================
"""

my_lst1 = ["Привет", "мир", "!"]
my_str1 = " ".join(my_lst1)
print(my_str1)
my_lst2 = ["apple", "banana", "cherry"]
my_str2 = ", ".join(my_lst2)
print(my_str2)

"""
9. Удаление пробелов
================================================
Удали пробелы слева в строке " Python".
Удали пробелы справа в строке "Python ".
Удали пробелы с обеих сторон в строке " Python ".
================================================
"""

print(" Python".lstrip())
print("Python ".rstrip())
print(" Python ".strip())

"""
10. Дополнительное задание
================================================
Создай строку text = "программирование", сделай первую букву заглавной.
Найди количество букв "р" в этой строке.
Выведи индекс первой буквы "и".
Разверни строку и выведи результат.
++++++++++++++++++++++++++++++++++++++++++++++++
"""

text = "программирование"
print(text.capitalize())
print(text.count("р"))
print(text.find("и"))
print(text[::-1])


"""
Спецсимволы
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Перевод строки
================================================
Создай строку text = "Hello\nPython".
Выведи её на экран. Объясни, почему "Python" перешел на новую строку.
================================================
"""

text = "Hello\nPython"
print(text)

"""
2. Горизонтальная табуляция
================================================
Создай строку t = "Python\tAutomation".
Выведи её и объясни, что делает \t.
================================================
"""

t = "Python\tAutomation"
print(t)

"""
3. Экранирование символов
================================================
Создай строку path = "C:\new\test.txt" и выведи её. Что произошло?
Исправь ошибку, используя экранирование.
Выведи строку "Марка вина "Ягодка"" так, чтобы кавычки внутри строки были корректными.
================================================
"""

path = "C:\\new\\test.txt"
print(path)
print("Марка вина \"Ягодка\"")

"""
4. Сырые (raw) строки
================================================
Создай строку path = r"C:\new\test.txt" и выведи её.
Объясни разницу между обычной и сырой строкой.
================================================
"""

path = r"C:\new\test.txt"
print(path)

"""
5. Использование разных спецсимволов
================================================
Создай строку s = "Hello\b World" и выведи её. Что произошло?
Создай строку s = "Hello\fPython" и выведи её.
================================================
"""

s = "Hello\b World"
print(s)
s = "Hello\fPython"
print(s)

"""
++++++++++++++++++++++++++++++++++++++++++++++++
Форматирование строк
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Формирование строк через конкатенацию
================================================
Создай переменные имя и возраст.
Сформируй строку "Меня зовут {имя}, мне {возраст} лет." с помощью оператора + и выведи её.
Попробуй добавить число в строку без str(). Что произойдёт?
================================================
"""

name = "Misha"
age = "5"
print("Меня зовут " + name + ", мне " + age + " лет.")

"""
2. Форматирование строк с .format()
================================================
Используя .format(), сформируй строку "Привет, меня зовут {имя}, мне {возраст} лет.".
Используй .format() с именованными параметрами ({name}, {age}).
Попробуй изменить порядок переменных в .format() и выведи строку.
================================================
"""

tsk2_s1 = "Привет, меня зовут {}, мне {} лет."
print(tsk2_s1.format("Pasha", 6))
tsk2_s2 = "Привет, меня зовут {имя}, мне {возраст} лет."
print(tsk2_s2.format(имя="Sasha", возраст="40"))
print(tsk2_s2.format(возраст=40, имя="Sasha"))

"""
3. Использование F-строк
================================================
Создай переменные город и год.
Выведи строку "Сегодня {год} год, и я живу в {город}." с помощью F-строки.
Используй F-строку, чтобы вывести "Через 5 лет будет {год + 5} год.".
================================================
"""

city = "Minsk"
year = 2026
print(f"Сегодня {year} год, и я живу в {city}.")
print(f"Через 5 лет будет {year + 5} год.")

"""
4. Операции внутри F-строк
================================================
Выведи "Дважды мой возраст: {...}", используя F-строку.
Применяй .upper() к переменной, чтобы вывести имя в верхнем регистре.
================================================
"""

age = 30
print(f"Дважды мой возраст: {age*2}")
lang = "python"
print(f"учим {lang.upper()}")

"""
5. Дополнительное задание
================================================
Используя .format(), сформируй строку "Курс валют: 1 доллар = 92.5 рубля.", подставляя переменные.
Используя F-строку, сформируй "Квадрат числа 7 равен 49.", вычисляя 7 ** 2 прямо внутри строки.
"""

print("Курс валют: 1 {} = {} рубля.".format("юань", 300))
a = 100
print(f"Квадрат числа {a} равен {a**2}.")
