import random
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Словари в Python (dict)
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1.Создайте словарь, в котором хранятся названия фруктов и их цены за 1 кг.
Добавьте в словарь еще один фрукт и выведите итоговый словарь.
===============================================
"""

dct = {'apple': 5, 'banana': 5, 'melon': 4}
print(dct)
dct['pear'] = 6
print(dct)

"""
2. Дан словарь с оценками студентов:
grades = {"Анна": 5, "Борис": 4, "Виктор": 3, "Галина": 5, "Дмитрий": 2}
Выведите имена студентов, у которых оценка не ниже 4.
===============================================
"""

grades = {"Анна": 5, "Борис": 4, "Виктор": 3, "Галина": 5, "Дмитрий": 2}
for name in grades:
    if grades[name] >= 4:
        print(name)

"""
3. Создайте словарь, содержащий название стран в качестве ключей и их столицы в качестве значений.
Пользователь вводит название страны.
Выведите столицу этой страны (если страна отсутствует в словаре, выведите "Страна не найдена").
===============================================
"""

dct_geo = {"Russia": "Moscow", "Belarus": "Minsk", "Poland": "Warsaw"}
country = input("enter country ")
print(dct_geo.get(country, "Страна не найдена"))

"""
4. Дан список студентов и их курсов:
students = [
    ("Анна", "Python"),
    ("Борис", "Java"),
    ("Виктор", "Python"),
    ("Галина", "C++"),
    ("Дмитрий", "Python")
]
Создайте словарь, в котором ключами будут названия курсов, а значениями — списки студентов, которые изучают этот курс.
===============================================
"""

students = [
    ("Анна", "Python"),
    ("Борис", "Java"),
    ("Виктор", "Python"),
    ("Галина", "C++"),
    ("Дмитрий", "Python")
]
res_dct = {}
for name, course in students:
    if course not in res_dct:
        res_dct[course] = []
    res_dct[course].append(name)
print(res_dct)

"""
5. Создайте словарь, содержащий оценки студентов:
Используя метод pop(), удалите студента с самой низкой оценкой и выведите обновленный словарь.
===============================================
"""

marks = {"Nina": 4, "Sasha": 5, "Pasha": 3, "Katia": 6}
worst_student = sorted(marks.items(), key=lambda x: x[1])[0][0]
marks.pop(worst_student)
print(marks)

"""
6. Дан список студентов:
students = ["Анна", "Борис", "Виктор", "Галина"]
Преобразуйте этот список в словарь, заполнив значения всех студентов None. Затем обновите словарь указав в значение возраст студентов.
===============================================
"""

students = ["Анна", "Борис", "Виктор", "Галина"]
dct_stud = dict.fromkeys(students)
print(dct_stud)
for key in dct_stud.keys():
    dct_stud[key] = random.randint(20, 35)
print(dct_stud)

"""
7. Дан словарь с курсами валют:
exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
Пользователь вводит валюту (USD, EUR или GBP).
Если валюта есть в словаре, выведите ее курс, иначе выведите "Неизвестная валюта". Если валюта не известна, то
добавьте новую валюты со значением None
"""

exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
currency = input("Введите валюту ")
print(exchange_rates.get(currency, "Неизвестная валюта"))
exchange_rates.setdefault(currency)
print(exchange_rates)

"""
8. Создайте два словаря:
dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
Объедините их с помощью update().
"""

dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
dict1.update(dict2)
print(dict1)

"""
+++++++++++++++++++++++++++++++++++++++++++++++
Кортежи в Python
+++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Создайте кортеж из пяти элементов (разных типов данных).
Выведите на экран второй элемент и последний элемент этого кортежа.
===============================================
"""

my_tuple = (1, 'asd', [1, 2, 3], True, 3.12)
print(my_tuple[1])
print(my_tuple[-1])

"""
2. Дан кортеж чисел:
nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
Выведите количество вхождений числа 4 в этом кортеже.
Найдите индекс первого вхождения числа 7.
===============================================
"""

nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
print(nums.count(4))
print(nums.index(7))

"""
3. Преобразуйте следующий список в кортеж:
lst = ["Python", "Java", "C++", "JavaScript"]
После преобразования проверьте, присутствует ли в кортеже элемент "C++".
===============================================
"""

lst = ["Python", "Java", "C++", "JavaScript"]
my_tuple2 = tuple(lst)
print("C++" in my_tuple2)

"""
4. Создайте кортеж с числами от 1 до 10.
Используя срезы, выведите:
Первые три элемента.
Последние три элемента.
Все элементы с шагом 2.
===============================================
"""

my_tuple3 = tuple([i for i in range(1, 11)])
print(my_tuple3[:3])
print(my_tuple3[-3:])
print(my_tuple3[::2])

"""
5. Создайте кортеж, содержащий вложенные список и словарь.
Попробуйте изменить список внутри кортежа, добавив в него новый элемент.
"""

my_tuple4 = ([1, 2, 3], {"name": "Sasha", "last_name": "Ivanov"})
my_tuple4[0].append("new_element")
print(my_tuple4)

